// Получение всех объектов
$.ajax({
    type: "GET",
    url: "http://neagent.info/realty/karta/ajax-get-illegal/",
    dataType: "text",
    data: "",
    complete: function (data) { },
    error: function (data) { },
    success: function (data, textStatus) {
        console.log(data);
    }
});

// Получение информации по конкретному объекту
// Не забыть подставить @id
$.ajax({
    type: "POST",
    url: "http://neagent.info/realty/karta/ajax-get-illegal-object/",
    dataType: "text",
    data: "id=" + id,
    complete: function (data) { },
    error: function (data) { },
    success: function (data, textStatus) {
        console.log(data);
    }
});

/* Пример ответа:
<div id="illegal-object-info" style="background:#fff; width:640px;">
   <h1>Подробная информация об объекте №1224</h1>
   <div class=line style="margin:15px 0 15px 0;"></div>
   <table>
      <tr>
         <td class="tdnm">Объект строительства:</td>
         <td>1224</td>
      </tr>
      <tr>
         <td class="tdnm">Дата добавления:</td>
         <td>2013-01-10 13:25:15</td>
      </tr>
      <tr>
         <td class="tdnm">Статус:</td>
         <td class="orange">На рассмотрении</td>
      </tr>
      <tr>
         <td class="tdnm">Описание объекта:</td>
         <td>При строительстве честного дома были возведены преграды для движения пешеходов по тротуару - участок возле дома поднят примерно на 30 см без пандуса. Также захвачена часть тротуара и на ней построен забор, с противоположной стороны тротуар также был намеренно сужен и на его месте оборудована клумба. Прошу вернуть тротуар пешеходам.</td>
      </tr>
      <tr>
         <td class="tdnm">Адрес:</td>
         <td>ул. Пугачева, 100 (ЦВО)</td>
      </tr>
      <tr>
         <td class="tdnm">Выявленные нарушения:</td>
         <td>не выявлены</td>
      </tr>
   </table>
</div>
*/

var ids = [1224, 1226, 1227, 1234, 1235, 1236, 1238, 1240, 1243, 1248, 1249, 1251, 1253, 1257, 1262, 1263, 1274, 1276, 1279, 1280, 1283, 1287, 1291, 1294, 1297, 1298, 1299, 1302, 1303, 1307, 1309, 1316, 1319, 1320, 1321, 1324, 1327, 1330, 1340, 1341, 1344, 1347, 1349, 1350, 1351, 1366, 1368, 1377, 1379, 1380, 1383, 1387, 1388, 1392, 1397, 1400, 1402, 1405, 1409, 1411, 1414, 1418, 1424, 1425, 1426, 1427, 1429, 1431, 1432, 1433, 1440, 1442, 1443, 1446, 1447, 1448, 1451, 1452, 1453, 1460, 1461, 1462, 1463, 1468, 1469, 1472, 1474, 1475, 1476, 1477, 1478, 1479, 1480, 1485, 1489, 1490, 1493, 1505, 1507, 1509, 1511, 1512, 1514, 1516, 1521, 1530, 1531, 1533, 1543, 1546, 1547, 1551, 1552, 1555, 1557, 1559, 1560, 1561, 1562, 1563, 1564, 1363, 1222, 1230, 1245, 1255, 1258, 1264, 1271, 1272, 1284, 1295, 1300, 1305, 1312, 1332, 1333, 1334, 1336, 1337, 1338, 1343, 1348, 1352, 1353, 1354, 1355, 1357, 1358, 1359, 1360, 1362, 1364, 1365, 1367, 1369, 1371, 1372, 1386, 1393, 1395, 1403, 1415, 1434, 1454, 1502, 1525, 1532, 1534, 1573, 1223, 1225, 1228, 1229, 1231, 1233, 1259, 1277, 1310, 1325, 1329, 1335, 1339, 1342, 1345, 1346, 1391, 1396, 1401, 1407, 1408, 1412, 1419, 1420, 1421, 1428, 1445, 1496, 1497, 1644, 1694, 1582, 1612, 1653, 1657, 1659, 1660, 1663, 1671, 1692, 1693, 1697, 1698, 1699, 1702, 1712, 1714, 1715, 1718, 1721, 1724, 1725, 1726, 1728, 1729, 1730, 1732, 1733, 1734, 1735, 1736, 1740, 1741, 1742, 1743, 1746, 1744, 1745, 1747, 1748, 1749, 1751, 1767, 1776, 1777, 1783, 1786, 1788, 1799, 1800, 1803, 1806, 1807, 1808, 1811, 1814, 1817, 1820, 1821, 1823, 1824, 1825, 1826, 1829, 1837, 1839, 1843, 1844, 1845, 1846, 1851, 1852, 1853, 1883, 1640, 1600, 1610, 1662, 1666, 1647, 1611, 1614, 1654, 1602]
var results = [];
(function getIllegal(i) {
    setTimeout(function () {
        var id = ids[i];
        console.log(id);

        $.ajax({
            type: "POST",
            url: "http://neagent.info/realty/karta/ajax-get-illegal-object/",
            dataType: "text",
            data: "id=" + id,
            complete: function (data) { },
            error: function (data) { },
            success: function (data, textStatus) {
                results.push({
                    id: id,
                    data: data
                });
            }
        });

        if (--i) {
            getIllegal(i);
        }
    }, 500);
})(ids.length);

JSON.stringify(results);